Revit 2026 API

# ExportLayerInfoSetCutLayerModifiers Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetCutLayerModifiers(
	IList<LayerModifier> cutLayermodifiers
)
```
```vb
Public Sub SetCutLayerModifiers (
	cutLayermodifiers As IList(Of LayerModifier)
)
```
```cpp
public:
void SetCutLayerModifiers(
	IList<LayerModifier^>^ cutLayermodifiers
)
```
```fsharp
member SetCutLayerModifiers :
        cutLayermodifiers : IList<LayerModifier> -> unit
```

#### Parameters

cutLayermodifiers IListLayerModifier

#### Reference

ExportLayerInfo Class

Autodesk.Revit.DB Namespace